## Guided steps

In [2]:
# pip install ipython-sql use it to install sql magic to jupyter.....

import sqlite3 as sql
import pandas as pd

In [4]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

### Overview of the data

In [5]:
%%sql
SELECT * FROM facts limit 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### Summary Statistics

In [6]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
    FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

### Exploring Outliers

In [12]:
%%sql
SELECT name
    FROM facts
    WHERE population == (SELECT MIN(population) FROM facts)
    OR population == (SELECT MAX(population) FROM facts) ;

 * sqlite:///factbook.db
Done.

[('Antarctica',), ('World',)]

### Exploring Average Population and Area

In [14]:
%%sql

SELECT AVG(population), AVG(area)
    FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

### Finding Densely Populated Countries

In [15]:
%%sql

SELECT name
    FROM facts
    WHERE (population > (SELECT AVG(population) FROM facts) AND area < (SELECT AVG(area) FROM facts))

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

## Next steps and additional analysis

+ Which countries have the highest ratios of water to land? Which countries have more water than land?
+ Which countries will add the most people to their population next year?
+ Which countries have a higher death rate than birth rate?

### Countries with highest water to land ratios

In [26]:
%%sql
SELECT name, ROUND(CAST(area_water as Float)/CAST(area_land as Float),2) as "ratio"
    FROM facts
    ORDER BY ratio DESC
    LIMIT 10

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.67),
 ('Virgin Islands', 4.52),
 ('Puerto Rico', 0.55),
 ('Bahamas, The', 0.39),
 ('Guinea-Bissau', 0.28),
 ('Malawi', 0.26),
 ('Netherlands', 0.23),
 ('Uganda', 0.22),
 ('Eritrea', 0.16),
 ('Liberia', 0.16)]

### Countries with more water than land

This could also be answered with the query above, since only the countries with ratios grater than 1 will have more water

In [30]:
%%sql
SELECT name
    FROM facts
    WHERE area_water > area_land;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

### Countries with the highest growth rates

Here we see that South Sudan will add the most people to their population next year, with a grouwth rate of 4% Annual

In [33]:
%%sql

SELECT name, population_growth
    FROM facts
    ORDER BY population_growth DESC
    LIMIT 15;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24),
 ('Qatar', 3.07),
 ('Burkina Faso', 3.03),
 ('Mali', 2.98),
 ('Cook Islands', 2.95),
 ('Iraq', 2.93),
 ('Ethiopia', 2.89),
 ('Zambia', 2.88),
 ('Western Sahara', 2.82),
 ('Gaza Strip', 2.81),
 ('Tanzania', 2.79)]

### Countries with higher death rate than birth date

Here we see that **Ukraine** is the country with the highest mortality rate within the countries that have a higher death rate than birth rate.

In [37]:
%%sql
SELECT name, death_rate, birth_rate
    FROM facts
    WHERE death_rate > birth_rate
    ORDER BY death_rate DESC

 * sqlite:///factbook.db
Done.

[('Ukraine', 14.46, 10.72),
 ('Bulgaria', 14.44, 8.92),
 ('Latvia', 14.31, 10.0),
 ('Lithuania', 14.27, 10.1),
 ('Russia', 13.69, 11.6),
 ('Serbia', 13.66, 9.08),
 ('Belarus', 13.36, 10.7),
 ('Hungary', 12.73, 9.16),
 ('Moldova', 12.59, 12.0),
 ('Estonia', 12.4, 10.51),
 ('Croatia', 12.18, 9.45),
 ('Romania', 11.9, 9.14),
 ('Germany', 11.42, 8.47),
 ('Slovenia', 11.37, 8.42),
 ('Greece', 11.09, 8.66),
 ('Portugal', 11.02, 9.27),
 ('Czech Republic', 10.34, 9.63),
 ('Italy', 10.19, 8.74),
 ('Poland', 10.19, 9.74),
 ('Bosnia and Herzegovina', 9.75, 8.87),
 ('Saint Pierre and Miquelon', 9.72, 7.42),
 ('Japan', 9.51, 7.93),
 ('Austria', 9.42, 9.41),
 ('Monaco', 9.24, 6.65)]